# UnusedTypesInTheProject Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..UnusedTypesInTheProject Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
Project contains unused families and/or types. Consider purging them out.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnusedTypesInTheProject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnusedTypesInTheProject As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnusedTypesInTheProject {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace